{
   "Physics": [
      {
         "file": "books/juypterNotebooks/XKCD_plots.ipynb",
         "zip": "",
         "html": "",
         "pdf": "books/jupyterNotebookPDF/XKCD_plots.pdf",
         "type": "notebook",
         "name": "XKCD Plots",
         "descript": "I am somewhat of an anomaly, not only in the AUIDS 301 classroom but also on the Augustana campus as a whole. As a 31-year-old student, I have experience and perspective that students who went straight from high school to university do not; this is not to claim superiority for myself, or a failing on any given student's part, only to say that they often have not had the opportunities to experience life as I have. I tend to believe that this experience manifests as maturity, and to a large part I still believe it does, but I have come to recognize that it also reveals itself as stubbornness. There are few places I have found that highlight this for me as taking this AUIDS 301 course has. The class is designed to help grow skills that I believe I have already matured; why would I need to develop teamwork skills, or how to put a resume together when I have spent the better part of the last 13 years doing so already? Truthfully, even as the class comes to a close, I still believe this. However, learning and reflecting on the foundations of interpersonal communication skills is not the only way to develop such skills. The application of these skills is just as, if not more, meaningful, and it is through the structure of AUIDS 301 that I was able to hone skills such as leadership, communication, delegation, etc. This is what sets AUIDS 301 apart from the previous two AUIDS courses I took; developing interpersonal skills is pointless, or at least ineffective, without real-world applications of said skills. Allowing students the opportunity to apply these skills through necessary interactions with their community partners and group members forces them to acknowledge any shortcomings that may be present. Many of my own shortcomings come down to trust; I speak far too much during group discussions, as well as with my group's community partner, due to my (unfounded) fear that my group members would be unable to remember every detail that needed to be addressed. I believed that my ability to delegate, be organized, and stay on track strengthened my interpersonal skills, but in reality, it tended to reduce my group members to spectators, instead of participants. I can see how allowing my group members to speak for themselves and address issues with the community partner not only allows them to develop their own interpersonal skills but strengthens the dynamic within the group. The group as a whole becomes more effective, and the group will always be more than the sum of its parts. All this is not to say that I don’t believe that the AUIDS course does not have its own shortcomings. I don’t believe I have seen a more uninterested group of students, myself included, than during the many workshop presentations during the course. Even the most valuable of information is useless if the recipients feel unwilling or unable to engage with it, and I struggled to extract and retain any useful information from the workshops. Overall, I feel the strengths of the AUIDS 301 course, and where I saw the most value, lay in its ability to allow its students to apply and grow the skills they have developed over the previous 3 years in a real-world scenario, whereas its weaknesses revolve around its desire to still attempt to lecture on the virtues of such skills.",
         "author": "XKCD Plots",
         "class": "XKCD Plotsaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa",
         "image": "Img/xkcd_adobe_express.svg"
      },
      {
         "file": "books/juypterNotebooks/TEST2.ipynb",
         "zip": "",
         "html": "books/jupyterNotebookHTML/TEST2.html",
         "pdf": "books/jupyterNotebookPDF/TEST2.pdf",
         "type": "notebook",
         "name": "TEST2",
         "descript": "TEST2",
         "author": "TEST2",
         "class": "TEST2",
         "image": ""
      },
      {
         "file": "books/juypterNotebooks/TEST3.ipynb",
         "zip": "",
         "html": "books/jupyterNotebookHTML/TEST3.html",
         "pdf": "books/jupyterNotebookPDF/TEST3.pdf",
         "type": "notebook",
         "name": "TEST3",
         "descript": "TEST3",
         "author": "TEST3",
         "class": "TEST3",
         "image": "Img/pineapple_adobe_express.svg"
      },
      {
         "file": "books/juypterBooks/zacktest/_build/html/index.html",
         "zip": "books/zippedJuypterBooks/zacktest.zip",
         "html": "",
         "pdf":"",
         "type": "book",
         "name": "Zack Test",
         "descript": "Zack Test",
         "author": "Zack Testafsdddddddddddddddddddddddddddddddddddddddddddddddddsfadf",
         "class": "Zack Testafdsssssssssssssssssssssssssssssssssssssssssssssssssssssss",
         "image": "Img/pineapple.jpg"
      },
      {
         "file": "books/juypterBooks/testbook/_build/html/index.html",
         "zip": "books/zippedJuypterBooks/testbook.zip",
         "html": "",
         "pdf":"books/jupyterBookPDF/book.pdf",
         "type": "book",
         "name": "Test Book",
         "descript": "Test Book",
         "author": "Test Book",
         "class": "Test Book",
         "image": ""
      }
   ],
   "Mathematics": [],
   "Computer Science": [],
   "Chemistry": [],
   "Biological Science": [],
   "E&E Engineering": [],
   "GESP": []
}